In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\m.maroof\miniconda3\lib\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in c:\users\m.maroof\miniconda3\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\m.maroof\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\m.maroof\miniconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\m.maroof\miniconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\m.maroof\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [6]:
import pandas as pd

In [12]:
data = { 
    'Name':['Maroof','Ali','Tanveer','Yasir'],
    'department': ['HR', 'IT', 'HR', 'IT'],
    'age':[17,18,20,19],
    'salary':[30000,5455,4545,2233],
}

In [13]:
df = pd.DataFrame(data)
df

      Name department  age  salary
0   Maroof         HR   17   30000
1      Ali         IT   18    5455
2  Tanveer         HR   20    4545
3    Yasir         IT   19    2233

In [14]:
filtered_df = df[(df['age'] > 18) & (df['salary'] < 5000)]
filtered_df

      Name department  age  salary
2  Tanveer         HR   20    4545
3    Yasir         IT   19    2233

In [15]:
grouped = df.groupby('department')

In [16]:
grouped['salary'].mean()

department
HR    2
IT    2
Name: salary, dtype: int64

In [17]:
grouped['salary'].sum()

department
HR    34545
IT     7688
Name: salary, dtype: int64

In [18]:
grouped['salary'].count()

department
HR    2
IT    2
Name: salary, dtype: int64

In [19]:
# Multiple aggregations for salary
grouped['salary'].agg(['mean', 'sum', 'max'])

# Custom aggregation
grouped.agg({
    'salary': ['mean', 'max'],
    'department': 'count'
})

             salary        department
               mean    max      count
department
HR          17272.5  30000          2
IT           3844.0   5455          2

In [20]:
df = pd.DataFrame({
    'region': ['North', 'North', 'South', 'South', 'North'],
    'department': ['HR', 'IT', 'HR', 'IT', 'HR'],
    'salary': [40000, 60000, 45000, 70000, 42000]
})

multi_group = df.groupby(['region', 'department'])['salary'].agg(['mean', 'sum'])

In [21]:
df

  region department  salary
0  North         HR   40000
1  North         IT   60000
2  South         HR   45000
3  South         IT   70000
4  North         HR   42000

In [22]:
multi_group

                      mean    sum
region department
North  HR          41000.0  82000
       IT          60000.0  60000
South  HR          45000.0  45000
       IT          70000.0  70000